# RvtLinkFileNameWithoutExt Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..RvtLinkFileNameWithoutExt Property
ParameterTypeId Class See Also
---
"File Name"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId RvtLinkFileNameWithoutExt { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property RvtLinkFileNameWithoutExt As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ RvtLinkFileNameWithoutExt {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace